Revit 2025 API
MetalFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalFinish" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MetalFinishType
Public Enumeration MetalFinishType
public enum class MetalFinishType
type MetalFinishType
Members
Member name | Value | Description
Polished | 0
SemiPolished | 1
Satin | 2
Brushed | 3
See Also
Reference
Autodesk.Revit.DB.Visual Namespace